'''
задача 1:
строки a и b менять нельзя
a = 'строка'
b = 'другая строка'
print(...)
написать принт, чтобы вывелось:
строка
другая строка

задача 2:
сгенерировать список из 7 элементов
вывести длину списка, сумму элементов,кол-во четных и нечетных чисел

задача 3:
написать функцию, которая принимает список и возвращает количество четных чисел

задача 4:
написать функцию, которая принимает список
функция возвращает список из двух элементов 
[минимальное_число, максимальное_число]

задача 5:
написать функцию, которая принимает список и меняет местами 
максимальное и минимальное число

задача 6:
написать функцию, которая принимает список и возвращает новый список, состоящий
только из отрицательных элементов

задача 7:
создать интерфейс для крестиков-ноликов (внутреннюю логику прописывать не нужно)

задача 8:
создать интерфейс для викторины (внутреннюю логику описывать не нужно)

задача 9:
создать меню для работы с окнами и текстом (блокнот)
изначально окно называется undefined
есть кнопки 

Open - вставляет в тектовое поле текст из файла, который открыли (открывая диалоговое окно)
        (при этом title у окна меняется на название абсолютного пути, до этого файла)
Save as - сохраняет то, что написано в текстовом файле (открывая диалоговое окно)
        (при этом title у окна меняется на название абсолютного пути, до этого файла)
New File - открывает новое окно с названием undefined
Save - сохраняет файл в то же место, из которого достали этот файл (если файл не был
        открыт, а просто создан (это видно по title), то открыть диалоговое окно)

сочетания клавиш: 
ctrl+w - закрывает окно (при этом спрашивая пользователя,
        действительно ли он хочет закрыть файл (askyesno), если он нажмет да,
        то закрыть файл, если нажмет нет, то ничего не делать)
ctrl+s - работает как пункт меню Save

'''

