from mcpi.minecraft import Minecraft as minecraft
import time

mc = minecraft.create()

'''
трехмерные списки
'''
cube = [
    # первая стенка
    [
        [57, 57, 57, 57],
        [57, 0, 0, 57],
        [57, 0, 0, 57],
        [57, 57, 57, 57]
    ],
    # вторая стенка
    [
        [57, 0, 0, 57],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [57, 0, 0, 57]
    ],
    # третья стенка
    [
        [57, 0, 0, 57],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [57, 0, 0, 57]
    ],
    # четвертая стенка
    [
        [57, 57, 57, 57],
        [57, 0, 0, 57],
        [57, 0, 0, 57],
        [57, 57, 57, 57]
    ],
]

# построим трехмерный список в майнкрафте
x, y, z = mc.player.getTilePos()
startX = x
startY = y
for depth in cube:
    for row in depth:
        for block in row:
            mc.setBlock(x, y, z, block)
            x += 1
        # возвращаем x на место
        x = startX
        # так как ряд построили, двигаеммся выше
        y += 1
    # так как построили всё по y, возвращаем его на место
    y = startY
    # так как построили двумерный массив, можем увеличить глубину
    z += 1
